In [179]:
import pandas as pd
df = pd.read_csv('Data.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [180]:
type(df)

pandas.core.frame.DataFrame

In [12]:
#Interplotation method make the average b/w two values. We are not using here as age should be numeric.
#df.interpolate()

In [13]:
#df

In [181]:
df.fillna(method='bfill', inplace=True)
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  58000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  48.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [182]:
X = df.iloc[:, :-1]
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0  58000.0
5   France  35.0  58000.0
6    Spain  48.0  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [183]:
Y = df.iloc[:, -1]
Y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [184]:
X = X.astype({'Country':'str', 'Age':'int64', 'Salary':'int64'}, inplace=True)
X

   Country  Age  Salary
0   France   44   72000
1    Spain   27   48000
2  Germany   30   54000
3    Spain   38   61000
4  Germany   40   58000
5   France   35   58000
6    Spain   48   52000
7   France   48   79000
8  Germany   50   83000
9   France   37   67000

In [185]:
type(X['Country'][0])

str

In [186]:
X.replace({
    'Country': {'France':0, 'Spain':1, 'Germany':2}
},inplace=True)

X

#0: France,   1: Spain,    2: Germany

   Country  Age  Salary
0        0   44   72000
1        1   27   48000
2        2   30   54000
3        1   38   61000
4        2   40   58000
5        0   35   58000
6        1   48   52000
7        0   48   79000
8        2   50   83000
9        0   37   67000

In [187]:
Y.astype({'Purchased': str}, inplace=True)

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [127]:
type(Y[0])

str

In [188]:
Y.replace({
    'Yes':1,
    'No':0
}, inplace=True)

In [129]:
Y

0    0
1    1
2    0
3    0
4    1
5    1
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int64

In [189]:
#Split the data into Train/Test split
from sklearn.model_selection import train_test_split
X_train, y_train, X_test, y_test = train_test_split(X, Y, test_size=0.3)

In [190]:
X_train

   Country  Age  Salary
7        0   48   79000
2        2   30   54000
6        1   48   52000
0        0   44   72000
5        0   35   58000
1        1   27   48000
4        2   40   58000

In [191]:
y_train

   Country  Age  Salary
8        2   50   83000
9        0   37   67000
3        1   38   61000

In [192]:
X_test

7    1
2    0
6    0
0    0
5    1
1    1
4    1
Name: Purchased, dtype: int64

In [193]:
y_test

8    0
9    1
3    0
Name: Purchased, dtype: int64

In [194]:
#Feature Scaling
from sklearn.preprocessing import StandardScaler
scX = StandardScaler()

In [199]:
X_train = scX.fit_transform(X_train)

In [198]:
X_train

array([[-1.02899151,  1.16808549,  1.81350165],
       [ 1.37198868, -1.13158282, -0.5907619 ],
       [ 0.17149859,  1.16808549, -0.78310298],
       [-1.02899151,  0.65704809,  1.14030785],
       [-1.02899151, -0.49278607, -0.20607973],
       [ 0.17149859, -1.51486087, -1.16778515],
       [ 1.37198868,  0.14601069, -0.20607973]])

In [200]:
X_test

7    1
2    0
6    0
0    0
5    1
1    1
4    1
Name: Purchased, dtype: int64